def construct_name2id_map():
    db_id_to_name_map = {
        -3: "上腹部水平横切面彩色多普勒", -7: "四腔心切面彩色多普勒", -10: "右室流出道切面彩色多普勒", -14: "三血管气管切面彩色多普勒", -11: "胎盘脐带插入口切面彩色多普勒",
        -15: "左室流出道切面彩色多普勒", -17: "脐带腹壁入口处横切面彩色多普勒", -29: '双肾冠状切面彩色多普勒', -30: '心底短轴切面彩色多普勒', -31: '三血管切面彩色多普勒',
        -16: "胫腓骨冠状切面(1)", -18: "尺桡骨冠状切面(1)", -100: "股骨长轴切面(1)", -101: "肱骨长轴切面(1)", -33: "足底切面(1)",
        -36: '左右肺动脉分叉切面彩色多普勒', -39: "上下腔静脉长轴切面彩色多普勒", -42: "主动脉弓长轴切面彩色多普勒", -43: "动脉导管弓长轴切面彩色多普勒",
        -148: "四腔心切面_收缩末期彩色多普勒", -149: "四腔心切面_舒张末期彩色多普勒",
        0: '未知',
        1: '其它', 2: "丘脑水平横切面", 3: "上腹部水平横切面", 4: "股骨长轴切面、肱骨长轴切面", 5: "小脑水平横切面", 6: "腰骶尾段脊柱矢状切面、颈胸段脊柱矢状切面",
        7: "四腔心切面", 8: "双眼球水平横切面", 9: "双肾横切面", 10: "右室流出道切面",
        11: "胎盘脐带插入口切面", 12: "鼻唇冠状切面", 13: "侧脑室水平横切面", 14: "三血管气管切面",
        15: "左室流出道切面", 16: "胫腓骨冠状切面", 17: "脐带腹壁入口处横切面", 18: "尺桡骨冠状切面", 19: "胎儿NT切面", 20: "胎儿头臀长测量切面",
        21: '膈肌冠状切面', 22: '颜面部正中矢状切面', 23: '左侧膈肌矢状切面', 24: '右侧膈肌矢状切面',
        25: '宫颈内口矢状切面', 26: '膀胱水平横切面彩色多普勒', 27: '左肾矢状切面', 28: '右肾矢状切面',
        29: '双肾冠状切面', 30: '心底短轴切面', 40: '前臂长轴切面', 41: '小腿长轴切面',
        31: '三血管切面', 32: '手掌冠状切面', 33: '足底切面', 34: '小腿矢状切面', 35: '颜面部冠状切面', 36: '左右肺动脉分叉切面', 37: '双足底切面',
        39: "上下腔静脉长轴切面", 42: "主动脉弓长轴切面", 43: "动脉导管弓长轴切面",
        100: "股骨长轴切面", 101: "肱骨长轴切面",
        102: "颈胸段脊柱矢状切面", 103: "腰骶尾段脊柱矢状切面", 104: '胆囊水平横切面', 105: "中段脊柱矢状切面", 106: "全程脊柱矢状切面",
        112: '心脏部分切面', 113: '颅脑部分切面', 114: '尺桡骨冠状切面、胫腓骨冠状切面', 115: '上腹部、胆囊水平横切面', 116: '肾、膈肌矢状切面',
        117: '肾、膈肌冠状切面', 118: '手掌冠状切面、足底切面', 119: '心动周期11切面', 120: "上牙槽横切面", 121: '尺桡骨冠状切面、胫腓骨冠状切面、小腿矢状切面',
        130: '软腭斜冠状切面', 131: '硬腭斜冠状切面',
        132: '唇裂-鼻唇冠状切面', 133: '腭裂-软腭斜冠状切面', 134: '腭裂-硬腭斜冠状切面', 135: '腹部_胆囊_脐带切面',
        136: '颅脑中晚孕冠矢状切面', 137: '颅脑正中矢状切面', 138: '颅脑旁矢状切面', 139: '颅脑大脑半球矢状切面',
        140: '颅脑经侧脑室前角冠状切面', 141: '颅脑经侧脑室体部冠状切面', 142: '颅脑经侧脑室三角区和后角冠状切面',
        143: '颅脑经额叶冠状切面', 144: '颅脑经枕叶冠状切面', 145: '颅脑经小脑冠状切面', 146: '颅顶部横切面', 147: '透明隔腔水平横切面',
        148: "四腔心切面_收缩末期", 149: "四腔心切面_舒张末期",

        190: "脊柱横切面", 191: "经肩胛骨横切面", 192: "经髂骨横切面",
        193: "经椎体冠状切面", 194: "经椎管或椎弓冠状切面", 195: "经椎体和椎弓连接处冠状切面",
        # 早孕期: [200,250), P.S. 增加时递增增加,且带上''(config也是)->config文件划分后可不加
        # 200: '三血管气管切面彩色多普勒', 202: '侧脑室水平横切面', 204: '四腔心切面彩色多普勒', 217: "胎盘脐带插入口切面",
        # 207: '胎盘测量切面', 208: '脐带腹壁插入口横切面', 209: '膀胱水平横切面彩色多普勒', 211: '左侧膈肌矢状切面', 212: '右侧膈肌矢状切面',
        # 214: '颅脑部分切面', 215: '心脏部分切面',  219: '上腹部水平横切面', 225: '小腿长轴切面', 221: '前臂长轴切面', 227: '上下肢长轴切面',
        201: '上肢长轴切面', 203: '双眼球及双耳冠状切面', 205: '宫颈内口矢状切面', 226: '小脑冠状切面', 228: '中脑导水管水平横切面',
        206: '羊水最大深度测量切面', 210: '鼻后三角冠状切面', 213: '膈肌矢状切面',
        216: '下肢长轴切面', 218: '胎儿NT与头臀长切面', 220: '双上肢长轴切面',
        222: '上臂长轴切面', 223: '双下肢长轴切面', 224: '大腿长轴切面',
        # 230: '四腔心切面彩色多普勒', 231: '三血管气管切面彩色多普勒',
        # 妇科：[300,400)
        # 307: "妊娠囊最大横切面",
        300: "卵巢切面", 301: "子宫横切面", 302: "子宫纵切面", 303: "子宫宫颈纵切面", -300: "卵巢切面(1)",
        305: "卵黄囊最大切面", 306: "胚芽最大切面",  308: "妊娠囊最大切面", 309: "早孕期切面",
        # 疾病特殊处理
        350: "子宫横切面_肌瘤", 351: "子宫纵切面_肌瘤",
        360: "子宫横切面_息肉", 361: "子宫纵切面_息肉",

        # 甲状腺
        400: '甲状腺切面', 401: "甲状腺横切面", 402: "甲状腺纵切面", 403: "甲状腺左叶横切面", 404: "甲状腺左叶纵切面",
        405: "甲状腺右叶横切面", 406: "甲状腺右叶纵切面", 407: "甲状腺峡部横切面",

        1000: '羊水测量切面', 1001: '胎盘测量切面', 1002: '颅脑测量切面', 1003: '脊柱测量切面', 1004: '频谱测量切面',
        1005: "大脑中动脉血流频谱", 1006: "脐动脉血流频谱",
        -10000: '双幅图', -10001: '四幅图', -10002: '频谱图'
    }

    # fubu_id_name_map = {
    #     3: "上腹部水平横切面", 104: '胆囊水平横切面', 115: '上腹部、胆囊水平横切面', -3: "上腹部水平横切面彩色多普勒",
    # }

    # head_id_name_map = {
    #     2: "丘脑水平横切面", 5: "小脑水平横切面", 13: "侧脑室水平横切面", 113: '颅脑部分切面', 1002: '颅脑测量切面',
    # }

    # heart_id_name_map = {
    #     7: "四腔心切面", 10: "右室流出道切面", 14: "三血管气管切面", 15: "左室流出道切面", 30: '心底短轴切面', 31: '三血管切面', 36: '左右肺动脉分叉切面',
    #     39: "上下腔静脉长轴切面", 42: "主动脉弓长轴切面", 43: "动脉导管弓长轴切面", 112: '心脏部分切面', 119: '心动周期11切面',
    #     -7: "四腔心切面彩色多普勒", -10: "右室流出道切面彩色多普勒", -14: "三血管气管切面彩色多普勒", -15: "左室流出道切面彩色多普勒",
    #     -30: '心底短轴切面彩色多普勒', -31: '三血管切面彩色多普勒', -36: '左右肺动脉分叉切面彩色多普勒', -39: "上下腔静脉长轴切面彩色多普勒",
    #     -42: "主动脉弓长轴切面彩色多普勒", -43: "动脉导管弓长轴切面彩色多普勒",
    # }

    # sizhi_id_name_map = {
    #     4: "股骨长轴切面、肱骨长轴切面", 16: "胫腓骨冠状切面", 18: "尺桡骨冠状切面", 32: '手掌冠状切面', 33: '足底切面', 34: '小腿矢状切面',
    #     37: '双足底切面', 40: '前臂长轴切面', 41: '小腿长轴切面', 100: "股骨长轴切面", 101: "肱骨长轴切面",
    #     -16: "胫腓骨冠状切面(1)", -18: "尺桡骨冠状切面(1)", -100: "股骨长轴切面(1)", -101: "肱骨长轴切面(1)", -33: "足底切面(1)", -34: '小腿矢状切面',
    #     118: '手掌冠状切面、足底切面', 121: '尺桡骨冠状切面、胫腓骨冠状切面、小腿矢状切面',
    # }

    # jizhu_id_name_map = {
    #     102: "颈胸段脊柱矢状切面", 103: "腰骶尾段脊柱矢状切面", 105: "中段脊柱矢状切面", 106: "全程脊柱矢状切面",
    # }

    name_to_db_id_map = {
        plane_name: plane_id for plane_id, plane_name in db_id_to_name_map.items()
    }

    db_id_to_name_map[-1] = '未知'

    return name_to_db_id_map, db_id_to_name_map
